AlmAck/svdtonuttx/demo/h/da1470_emmc.h
/****************************************************************************
 * ./tmp/da1470_emmc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_EMMC_H
#define __DA1470_EMMC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470_EMMC_EMMC_ADMA_ERR_STAT_R_OFFSET         0x0054 /* This register stores the ADMA state during an ADMA error. This register is appli */
#define DA1470_EMMC_EMMC_ADMA_SA_LOW_R_OFFSET           0x0058 /* This register holds the lower 32-bit system address for DMA transfer. This regis */
#define DA1470_EMMC_EMMC_ARGUMENT_R_OFFSET              0x0008 /* This register is used to configure the SD/eMMC command argument. */
#define DA1470_EMMC_EMMC_AT_CTRL_R_OFFSET               0x0540 /* This register controls some aspects of tuning and auto-tuning features. Do not p */
#define DA1470_EMMC_EMMC_AT_STAT_R_OFFSET               0x0544 /* Register to read the Center, Left and Right codes used by tuning and auto-tuning */
#define DA1470_EMMC_EMMC_AUTO_CMD_STAT_R_OFFSET         0x003C /* This register is used to indicate the CMD12 response error of Auto CMD12, and th */
#define DA1470_EMMC_EMMC_BGAP_CTRL_R_OFFSET             0x002A /* This register is used by the host driver to control any operation related to Blo */
#define DA1470_EMMC_EMMC_BLOCKCOUNT_R_OFFSET            0x0006 /* This register is used to configure the number of data blocks. This register is a */
#define DA1470_EMMC_EMMC_BLOCKSIZE_R_OFFSET             0x0004 /* This register is used to configure an SDMA buffer boundary and the number of byt */
#define DA1470_EMMC_EMMC_BOOT_CTRL_R_OFFSET             0x052E /* This register is used to control the eMMC Boot operation. */
#define DA1470_EMMC_EMMC_BUF_DATA_R_OFFSET              0x0020 /* This register is used to access the packet buffer. This register is applicable f */
#define DA1470_EMMC_EMMC_CAPABILITIES1_R_OFFSET         0x0040 /* This register provides the Host Driver with information specific to the Host Con */
#define DA1470_EMMC_EMMC_CAPABILITIES2_R_OFFSET         0x0044 /* This register provides the Host Driver with information specific to the Host Con */
#define DA1470_EMMC_EMMC_CLK_CTRL_R_OFFSET              0x002C /* This register controls SDCLK (card clock) in an SD/eMMC mode and RCLK in the UHS */
#define DA1470_EMMC_EMMC_CMD_R_OFFSET                   0x000E /* This register is used to provide the information related to a command and a resp */
#define DA1470_EMMC_EMMC_CQCAP_OFFSET                   0x0184 /* This register indicates the capabilities of the command queuing engine. */
#define DA1470_EMMC_EMMC_CURR_CAPABILITIES1_R_OFFSET    0x0048 /* This register indicate the maximum current capability for each voltage, for VDD1 */
#define DA1470_EMMC_EMMC_CURR_CAPABILITIES2_R_OFFSET    0x004C /* This register indicates the maximum current capability for each voltage (for VDD */
#define DA1470_EMMC_EMMC_EMBEDDED_CTRL_R_OFFSET         0x0F6C /* This register controls the embedded device. When the Host Controller is connecte */
#define DA1470_EMMC_EMMC_EMMC_CTRL_R_OFFSET             0x052C /* This register is used to control the eMMC operation. */
#define DA1470_EMMC_EMMC_ERROR_INT_SIGNAL_EN_R_OFFSET   0x003A /* This register is used to select the interrupt status that is notified to the Hos */
#define DA1470_EMMC_EMMC_ERROR_INT_STAT_EN_R_OFFSET     0x0036 /* This register sets the Interrupt Status for Error Interrupt Status register (ERR */
#define DA1470_EMMC_EMMC_ERROR_INT_STAT_R_OFFSET        0x0032 /* This register enables an interrupt when the Error Interrupt Status Enable is ena */
#define DA1470_EMMC_EMMC_FORCE_AUTO_CMD_STAT_R_OFFSET   0x0050 /* The register is not a physically implemented but is an address at which the Auto */
#define DA1470_EMMC_EMMC_FORCE_ERROR_INT_STAT_R_OFFSET  0x0052 /* This register is not physically implemented but is an address at which the Error */
#define DA1470_EMMC_EMMC_HOST_CNTRL_VERS_R_OFFSET       0x00FE /* This register is used to indicate the Host Controller Version number. */
#define DA1470_EMMC_EMMC_HOST_CTRL1_R_OFFSET            0x0028 /* This register is used to control the operation of the Host Controller. This regi */
#define DA1470_EMMC_EMMC_HOST_CTRL2_R_OFFSET            0x003E /* This register is used to control how the Host Controller operates. This register */
#define DA1470_EMMC_EMMC_MBIU_CTRL_R_OFFSET             0x0510 /* This register is used to select the valid burst types that the AHB Master bus in */
#define DA1470_EMMC_EMMC_MSHC_CTRL_R_OFFSET             0x0508 /* This register is used to control the operation of MSHC Host Controller. */
#define DA1470_EMMC_EMMC_MSHC_VER_ID_R_OFFSET           0x0500 /* This register reflects the current release number of DWC_mshc/DWC_mshc_lite. */
#define DA1470_EMMC_EMMC_MSHC_VER_TYPE_R_OFFSET         0x0504 /* This register reflects the current release type of DWC_mshc/DWC_mshc_lite. */
#define DA1470_EMMC_EMMC_NORMAL_INT_SIGNAL_EN_R_OFFSET  0x0038 /* This register is used to select the interrupt status that is indicated to the Ho */
#define DA1470_EMMC_EMMC_NORMAL_INT_STAT_EN_R_OFFSET    0x0034 /* This register enables the Interrupt Status for Normal Interrupt Status register  */
#define DA1470_EMMC_EMMC_NORMAL_INT_STAT_R_OFFSET       0x0030 /* This register reflects the status of the Normal Interrupt. This register is appl */
#define DA1470_EMMC_EMMC_PRESET_DDR50_R_OFFSET          0x006E /* This register defines the Preset Value for DDR50 and High Speed DDR speed modes  */
#define DA1470_EMMC_EMMC_PRESET_DS_R_OFFSET             0x0062 /* This register defines Preset Value for Default Speed mode in SD mode. */
#define DA1470_EMMC_EMMC_PRESET_HS_R_OFFSET             0x0064 /* This register defines Preset Value for High Speed mode in SD mode. */
#define DA1470_EMMC_EMMC_PRESET_INIT_R_OFFSET           0x0060 /* This register defines Preset Value for Initialization in SD/eMMC mode. */
#define DA1470_EMMC_EMMC_PRESET_SDR104_R_OFFSET         0x006C /* This register defines Preset Value for SDR104 and HS200 speed modes in the SD an */
#define DA1470_EMMC_EMMC_PRESET_SDR12_R_OFFSET          0x0066 /* This register defines Preset Value for SDR12 and Legacy speed mode in SD and eMM */
#define DA1470_EMMC_EMMC_PRESET_SDR25_R_OFFSET          0x0068 /* This register defines Preset Value for SDR25 and High Speed SDR speed mode in SD */
#define DA1470_EMMC_EMMC_PRESET_SDR50_R_OFFSET          0x006A /* This register defines Preset Value for SDR50 speed mode in SD mode. */
#define DA1470_EMMC_EMMC_PRESET_UHS2_R_OFFSET           0x0074 /* This register is used to hold the preset value for UHS-II and HS400 speed modes  */
#define DA1470_EMMC_EMMC_PSTATE_OFFSET                  0x0024 /* This register indicates the present status of the Host Controller. This register */
#define DA1470_EMMC_EMMC_PWR_CTRL_R_OFFSET              0x0029 /* This register is used to control the bus power for the Card. This register is ap */
#define DA1470_EMMC_EMMC_P_EMBEDDED_CNTRL_OFFSET        0x00E6 /* This register points to the location of UHS-II embedded control registers. */
#define DA1470_EMMC_EMMC_P_VENDOR_SPECIFIC_AREA_OFFSET  0x00E8 /* This register used as a pointer for the Vendor Specific Area 1. */
#define DA1470_EMMC_EMMC_P_VNDR2_SPECIFIC_AREA_OFFSET   0x00EA /* This register is used as a pointer for the Vendor Specific Area 2. */
#define DA1470_EMMC_EMMC_RESP01_R_OFFSET                0x0010 /* This register stores 39-08 bits of the Response Field for an SD/eMMC mode.  The  */
#define DA1470_EMMC_EMMC_RESP23_R_OFFSET                0x0014 /* This register stores 71-40 bits of the Response Field for an SD/eMMC mode. This  */
#define DA1470_EMMC_EMMC_RESP45_R_OFFSET                0x0018 /* This register stores 103-72 bits of the Response Field for an SD/eMMC mode.  The */
#define DA1470_EMMC_EMMC_RESP67_R_OFFSET                0x001C /* This register stores 135-104 bits of the Response Field for an SD/eMMC mode.     */
#define DA1470_EMMC_EMMC_SDMASA_R_OFFSET                0x0000 /* This register is used to configure a 32-bit Block Count or an SDMA System Addres */
#define DA1470_EMMC_EMMC_SLOT_INTR_STATUS_R_OFFSET      0x00FC /* This register indicates the Interrupt status of each slot. */
#define DA1470_EMMC_EMMC_SW_RST_R_OFFSET                0x002F /* This register is used to generate a reset pulse by writing 1 to each bit of this */
#define DA1470_EMMC_EMMC_TOUT_CTRL_R_OFFSET             0x002E /* This register is used to set the Data Timeout Counter value for an SD/eMMC mode  */
#define DA1470_EMMC_EMMC_WUP_CTRL_R_OFFSET              0x002B /* This register is mandatory for the Host Controller, but the wakeup functionality */
#define DA1470_EMMC_EMMC_XFER_MODE_R_OFFSET             0x000C /* This register is used to control the operation of data transfers for an SD/eMMC  */

