AlmAck/svdtonuttx/demo/h/da1470_emmc.h
#define ADMA_LEN_ERR                                    (1U << 2) /* ADMA Length Mismatch Error States This error occurs in the following instances:  */
#define ADMA_ERR_STATES_MASK                            (0x3 << 0) /* ADMA Error States These bits indicate the state of ADMA when an error occurs dur */
#define ADMA_ERR_STATES_POS                             (0) /* ADMA Error States These bits indicate the state of ADMA when an error occurs dur */

/* EMMC_ADMA_SA_LOW_R Register */

#define ADMA_SA_LOW_MASK                                (0xFFFFFFFF << 0) /* ADMA System Address  These bits indicate the lower 32 bits of the ADMA system ad */
#define ADMA_SA_LOW_POS                                 (0) /* ADMA System Address  These bits indicate the lower 32 bits of the ADMA system ad */

/* EMMC_ARGUMENT_R Register */

#define ARGUMENT_MASK                                   (0xFFFFFFFF << 0) /* Command Argument. These bits specify the SD/eMMC command argument that is specif */
#define ARGUMENT_POS                                    (0) /* Command Argument. These bits specify the SD/eMMC command argument that is specif */

/* EMMC_AT_CTRL_R Register */

#define SWIN_TH_VAL_MASK                                (0x7 << 24) /* Sampling window threshold value setting The maximum value that can be set here d */
#define SWIN_TH_VAL_POS                                 (24) /* Sampling window threshold value setting The maximum value that can be set here d */
#define POST_CHANGE_DLY_MASK                            (0x3 << 19) /* Time taken for phase switching and stable clock output. Specifies the maximum ti */
#define POST_CHANGE_DLY_POS                             (19) /* Time taken for phase switching and stable clock output. Specifies the maximum ti */
#define PRE_CHANGE_DLY_MASK                             (0x3 << 17) /* Maximum Latency specification between cclk_tx and cclk_rx. Values: 0x0 (LATENCY_ */
#define PRE_CHANGE_DLY_POS                              (17) /* Maximum Latency specification between cclk_tx and cclk_rx. Values: 0x0 (LATENCY_ */
#define TUNE_CLK_STOP_EN                                (1U << 16) /* Clock stopping control for Tuning and auto-tuning circuit. When enabled, clock g */
#define SW_TUNE_EN                                      (1U << 4) /* This fields enables software-managed tuning flow. Values: 0x1 (SW_TUNING_ENABLE) */
#define RPT_TUNE_ERR                                    (1U << 3) /* Framing errors are not generated when executing tuning. This debug bit allows us */
#define SWIN_TH_EN                                      (1U << 2) /* Sampling window Threshold enable Selects the tuning mode Field should be program */

/* EMMC_AT_STAT_R Register */

#define L_EDGE_PH_CODE_MASK                             (0xFF << 16) /* Left Edge Phase code. Reading this field returns the phase code value used by Au */
#define L_EDGE_PH_CODE_POS                              (16) /* Left Edge Phase code. Reading this field returns the phase code value used by Au */
#define R_EDGE_PH_CODE_MASK                             (0xFF << 8) /* Right Edge Phase code. Reading this field returns the phase code value used by A */
#define R_EDGE_PH_CODE_POS                              (8) /* Right Edge Phase code. Reading this field returns the phase code value used by A */
#define CENTER_PH_CODE_MASK                             (0xFF << 0) /* Centered Phase code. Reading this field returns the current value on tuning_cclk */
#define CENTER_PH_CODE_POS                              (0) /* Centered Phase code. Reading this field returns the current value on tuning_cclk */

/* EMMC_AUTO_CMD_STAT_R Register */

#define CMD_NOT_ISSUED_AUTO_CMD12                       (1U << 7) /* Command Not Issued By Auto CMD12 Error If this bit is set to 1, CMD_wo_DAT is no */
#define AUTO_CMD_RESP_ERR                               (1U << 5) /* Auto CMD Response Error This bit is set when Response Error Check Enable in the  */
#define AUTO_CMD_IDX_ERR                                (1U << 4) /* Auto CMD Index Error This bit is set if the command index error occurs in respon */
#define AUTO_CMD_EBIT_ERR                               (1U << 3) /* Auto CMD End Bit Error This bit is set when detecting that the end bit of comman */
#define AUTO_CMD_CRC_ERR                                (1U << 2) /* Auto CMD CRC Error This bit is set when detecting a CRC error in the command res */
#define AUTO_CMD_TOUT_ERR                               (1U << 1) /* Auto CMD Timeout Error This bit is set if no response is returned with 64 SDCLK  */
#define AUTO_CMD12_NOT_EXEC                             (1U << 0) /* Auto CMD12 Not Executed If multiple memory block data transfer is not started du */

/* EMMC_BGAP_CTRL_R Register */

#define INT_AT_BGAP                                     (1U << 3) /* Interrupt At Block Gap. This bit is valid only in the 4-bit mode of an SDIO card */
#define RD_WAIT_CTRL                                    (1U << 2) /* Read Wait Control. This bit is used to enable the read wait protocol to stop rea */
#define CONTINUE_REQ                                    (1U << 1) /* Continue Request. This bit is used to restart the transaction, which was stopped */
#define STOP_BG_REQ                                     (1U << 0) /* Stop At Block Gap Request. This bit is used to stop executing read and write tra */

/* EMMC_BLOCKCOUNT_R Register */

#define BLOCK_CNT_MASK                                  (0xFFFF << 0) /* 16-bit Block Count. - If the Host Version 4 Enable bit is set 0 or the 16-bit Bl */
#define BLOCK_CNT_POS                                   (0) /* 16-bit Block Count. - If the Host Version 4 Enable bit is set 0 or the 16-bit Bl */

/* EMMC_BLOCKSIZE_R Register */

#define SDMA_BUF_BDARY_MASK                             (0x7 << 12) /* SDMA Buffer Boundary. These bits specify the size of contiguous buffer in system */
#define SDMA_BUF_BDARY_POS                              (12) /* SDMA Buffer Boundary. These bits specify the size of contiguous buffer in system */
#define XFER_BLOCK_SIZE_MASK                            (0xFFF << 0) /* Transfer Block Size. These bits specify the block size of data transfers. In cas */
#define XFER_BLOCK_SIZE_POS                             (0) /* Transfer Block Size. These bits specify the block size of data transfers. In cas */

/* EMMC_BOOT_CTRL_R Register */

#define BOOT_TOUT_CNT_MASK                              (0xF << 12) /* Boot Ack Timeout Counter Value. This value determines the interval by which boot */
#define BOOT_TOUT_CNT_POS                               (12) /* Boot Ack Timeout Counter Value. This value determines the interval by which boot */
#define BOOT_ACK_ENABLE                                 (1U << 8) /* Boot Acknowledge Enable When this bit set, DWC_mshc checks for boot acknowledge  */
#define VALIDATE_BOOT                                   (1U << 7) /* Validate Mandatory Boot Enable bit This bit is used to validate the MAN_BOOT_EN  */
#define MAN_BOOT_EN                                     (1U << 0) /* Mandatory Boot Enable This bit is used to initiate the mandatory boot operation. */

