AlmAck/svdtonuttx/demo/h/da1470_emmc.h
/* EMMC_BUF_DATA_R Register */

#define BUF_DATA_MASK                                   (0xFFFFFFFF << 0) /* Buffer Data. These bits enable access to the Host Controller packet buffer. */
#define BUF_DATA_POS                                    (0) /* Buffer Data. These bits enable access to the Host Controller packet buffer. */

/* EMMC_CAPABILITIES1_R Register */

#define SLOT_TYPE_R_MASK                                (0x3 << 30) /* Slot Type These bits indicate usage of a slot by a specific Host System. Values: */
#define SLOT_TYPE_R_POS                                 (30) /* Slot Type These bits indicate usage of a slot by a specific Host System. Values: */
#define ASYNC_INT_SUPPORT                               (1U << 29) /* Asynchronous Interrupt Support (SD Mode only) Values: 0x0 (FALSE): Asynchronous  */
#define SYS_ADDR_64_V3                                  (1U << 28) /* 64-bit System Address Support for V3 This bit sets the Host controller to suppor */
#define SYS_ADDR_64_V4                                  (1U << 27) /* 64-bit System Address Support for V4 This bit sets the Host Controller to suppor */
#define VOLT_18                                         (1U << 26) /* Voltage Support for 1.8V Values: 0x0 (FALSE): 1.8V Not Supported 0x1 (TRUE): 1.8 */
#define VOLT_30                                         (1U << 25) /* Voltage Support for SD 3.0V or Embedded 1.2V Values: 0x0 (FALSE): SD 3.0V or Emb */
#define VOLT_33                                         (1U << 24) /* Voltage Support for 3.3V Values: 0x0 (FALSE): 3.3V Not Supported 0x1 (TRUE): 3.3 */
#define SUS_RES_SUPPORT                                 (1U << 23) /* Suspense/Resume Support This bit indicates whether the Host Controller supports  */
#define SDMA_SUPPORT                                    (1U << 22) /* SDMA Support This bit indicates whether the Host Controller is capable of using  */
#define HIGH_SPEED_SUPPORT                              (1U << 21) /* High Speed Support This bit indicates whether the Host Controller and the Host S */
#define ADMA2_SUPPORT                                   (1U << 19) /* ADMA2 Support This bit indicates whether the Host Controller is capable of using */
#define EMBEDDED_8_BIT                                  (1U << 18) /* 8-bit Support for Embedded Device This bit indicates whether the Host Controller */
#define MAX_BLK_LEN_MASK                                (0x3 << 16) /* Maximum Block Length This bit indicates the maximum block size that the Host dri */
#define MAX_BLK_LEN_POS                                 (16) /* Maximum Block Length This bit indicates the maximum block size that the Host dri */
#define BASE_CLK_FREQ_MASK                              (0xFF << 8) /* Base Clock Frequency for SD clock These bits indicate the base (maximum) clock f */
#define BASE_CLK_FREQ_POS                               (8) /* Base Clock Frequency for SD clock These bits indicate the base (maximum) clock f */
#define TOUT_CLK_UNIT                                   (1U << 7) /* Timeout Clock Unit This bit shows the unit of base clock frequency used to detec */
#define TOUT_CLK_FREQ_MASK                              (0x3F << 0) /* Timeout Clock Frequency  This bit shows the base clock frequency used to detect  */
#define TOUT_CLK_FREQ_POS                               (0) /* Timeout Clock Frequency  This bit shows the base clock frequency used to detect  */

/* EMMC_CAPABILITIES2_R Register */

#define VDD2_18V_SUPPORT                                (1U << 28) /* 1.8V VDD2 Support This bit indicates support of VDD2 for the Host System. Values */
#define ADMA3_SUPPORT                                   (1U << 27) /* ADMA3 Support This bit indicates whether the Host Controller is capable of using */
#define CLK_MUL_MASK                                    (0xFF << 16) /* Clock Multiplier These bits indicate the clock multiplier of the programmable cl */
#define CLK_MUL_POS                                     (16) /* Clock Multiplier These bits indicate the clock multiplier of the programmable cl */
#define RE_TUNING_MODES_MASK                            (0x3 << 14) /* Re-Tuning Modes (UHS-I only) These bits select the re-tuning method and limit th */
#define RE_TUNING_MODES_POS                             (14) /* Re-Tuning Modes (UHS-I only) These bits select the re-tuning method and limit th */
#define USE_TUNING_SDR50                                (1U << 13) /* Use Tuning for SDR50 (UHS-I only) */
#define RETUNE_CNT_MASK                                 (0xF << 8) /* Timer Count for Re-Tuning (UHS-I only) - 0x0: Re-Tuning Timer disabled - 0x1: 1  */
#define RETUNE_CNT_POS                                  (8) /* Timer Count for Re-Tuning (UHS-I only) - 0x0: Re-Tuning Timer disabled - 0x1: 1  */
#define DRV_TYPED                                       (1U << 6) /* Driver Type D Support (UHS-I only) This bit indicates support of Driver Type D f */
#define DRV_TYPEC                                       (1U << 5) /* Driver Type C Support (UHS-I only) This bit indicates support of Driver Type C f */
#define DRV_TYPEA                                       (1U << 4) /* Driver Type A Support (UHS-I only) This bit indicates support of Driver Type A f */
#define UHS2_SUPPORT                                    (1U << 3) /* UHS-II Support (UHS-II only) This bit indicates whether Host Controller supports */
#define DDR50_SUPPORT                                   (1U << 2) /* DDR50 Support (UHS-I only) Values: 0x0 (FALSE): DDR50 is not supported 0x1 (TRUE */
#define SDR104_SUPPORT                                  (1U << 1) /* SDR104 Support (UHS-I only) This bit mentions that SDR104 requires tuning. Value */
#define SDR50_SUPPORT                                   (1U << 0) /* SDR50 Support (UHS-I only) Thsi bit indicates that SDR50 is supported. The bit 1 */

/* EMMC_CLK_CTRL_R Register */

#define FREQ_SEL_MASK                                   (0xFF << 8) /* SDCLK/RCLK Frequency Select. These bits are used to select the frequency of the  */
#define FREQ_SEL_POS                                    (8) /* SDCLK/RCLK Frequency Select. These bits are used to select the frequency of the  */
#define UPPER_FREQ_SEL_MASK                             (0x3 << 6) /* These bits specify the upper 2 bits of 10-bit SDCLK/RCLK Frequency Select contro */
#define UPPER_FREQ_SEL_POS                              (6) /* These bits specify the upper 2 bits of 10-bit SDCLK/RCLK Frequency Select contro */
#define CLK_GEN_SELECT                                  (1U << 5) /* Clock Generator Select. This bit is used to select the clock generator mode in S */
#define PLL_ENABLE                                      (1U << 3) /* PLL Enable. This bit is used to activate the PLL (applicable when Host Version 4 */
#define SD_CLK_EN                                       (1U << 2) /* SD/eMMC Clock Enable. This bit stops the SDCLK or RCLK when set to 0. The SDCLK/ */
#define INTERNAL_CLK_STABLE                             (1U << 1) /* Internal Clock Stable This bit enables the Host Driver to check the clock stabil */
#define INTERNAL_CLK_EN                                 (1U << 0) /* Internal Clock Enable. This bit is set to 0 when the Host Driver is not using th */

/* EMMC_CMD_R Register */

#define CMD_INDEX_MASK                                  (0x3F << 8) /* Command Index. These bits are set to the command number that is specified in bit */
#define CMD_INDEX_POS                                   (8) /* Command Index. These bits are set to the command number that is specified in bit */
#define CMD_TYPE_MASK                                   (0x3 << 6) /* Command Type. These bits indicate the command type. Note: While issuing Abort CM */
#define CMD_TYPE_POS                                    (6) /* Command Type. These bits indicate the command type. Note: While issuing Abort CM */
#define DATA_PRESENT_SEL                                (1U << 5) /* Data Present Select. This bit is set to 1 to indicate that data is present and t */
#define CMD_IDX_CHK_ENABLE                              (1U << 4) /* Command Index Check Enable. This bit enables the Host Controller to check the in */
#define CMD_CRC_CHK_ENABLE                              (1U << 3) /* Command CRC Check Enable. This bit enables the Host Controller to check the CRC  */
#define SUB_CMD_FLAG                                    (1U << 2) /* Sub Command Flag. This bit distinguishes between a main command and a sub comman */
#define RESP_TYPE_SELECT_MASK                           (0x3 << 0) /* Response Type Select. This bit indicates the type of response expected from the  */
#define RESP_TYPE_SELECT_POS                            (0) /* Response Type Select. This bit indicates the type of response expected from the  */

/* EMMC_CQCAP Register */

#define CRYPTO_SUPPORT                                  (1U << 28) /* Crypto Support    This bit indicates whether the Host Controller supports crypto */
#define CQCCAP_RSVD2_MASK                               (0xFFF << 16) /* These bits [27:16] of the CQCAP register are reserved. They always return 0. */
#define CQCCAP_RSVD2_POS                                (16) /* These bits [27:16] of the CQCAP register are reserved. They always return 0. */
#define ITCFMUL_MASK                                    (0xF << 12) /* Internal Timer Clock Frequency Multiplier (ITCFMUL) This field indicates the fre */
#define ITCFMUL_POS                                     (12) /* Internal Timer Clock Frequency Multiplier (ITCFMUL) This field indicates the fre */
#define ITCFVAL_MASK                                    (0x3FF << 0) /* Internal Timer Clock Frequency Value (ITCFVAL) This field scales the frequency o */
#define ITCFVAL_POS                                     (0) /* Internal Timer Clock Frequency Value (ITCFVAL) This field scales the frequency o */

/* EMMC_CURR_CAPABILITIES1_R Register */

#define MAX_CUR_18V_MASK                                (0xFF << 16) /* Maximum Current for 1.8V This bit specifies the Maximum Current for 1.8V VDD1 po */
#define MAX_CUR_18V_POS                                 (16) /* Maximum Current for 1.8V This bit specifies the Maximum Current for 1.8V VDD1 po */
#define MAX_CUR_30V_MASK                                (0xFF << 8) /* Maximum Current for 3.0V This bit specifies the Maximum Current for 3.0V VDD1 po */
#define MAX_CUR_30V_POS                                 (8) /* Maximum Current for 3.0V This bit specifies the Maximum Current for 3.0V VDD1 po */
#define MAX_CUR_33V_MASK                                (0xFF << 0) /* Maximum Current for 3.3V This bit specifies the Maximum Current for 3.3V VDD1 po */
#define MAX_CUR_33V_POS                                 (0) /* Maximum Current for 3.3V This bit specifies the Maximum Current for 3.3V VDD1 po */

