AlmAck/svdtonuttx/demo/h/da1470_emmc.h
/* EMMC_CURR_CAPABILITIES2_R Register */

#define MAX_CUR_VDD2_18V_MASK                           (0xFF << 0) /* Maximum Current for 1.8V VDD2 This bit specifies the Maximum Current for 1.8V VD */
#define MAX_CUR_VDD2_18V_POS                            (0) /* Maximum Current for 1.8V VDD2 This bit specifies the Maximum Current for 1.8V VD */

/* EMMC_EMBEDDED_CTRL_R Register */

#define BACK_END_PWR_CTRL_MASK                          (0x7F << 24) /* Back-End Power Control (SD Mode)  Each bit of this field controls back-end power */
#define BACK_END_PWR_CTRL_POS                           (24) /* Back-End Power Control (SD Mode)  Each bit of this field controls back-end power */
#define INT_PIN_SEL_MASK                                (0x7 << 20) /* Interrupt Pin Select  These bits enable the interrupt pin inputs. - 000 : Interr */
#define INT_PIN_SEL_POS                                 (20) /* Interrupt Pin Select  These bits enable the interrupt pin inputs. - 000 : Interr */
#define CLK_PIN_SEL_MASK                                (0x7 << 16) /* Clock Pin Select (SD Mode)  This bit is selected by one of clock pin outputs. -  */
#define CLK_PIN_SEL_POS                                 (16) /* Clock Pin Select (SD Mode)  This bit is selected by one of clock pin outputs. -  */
#define BUS_WIDTH_PRESET_MASK                           (0x7F << 8) /* Bus Width Preset (SD Mode)  Each bit of this field specifies the bus width for e */
#define BUS_WIDTH_PRESET_POS                            (8) /* Bus Width Preset (SD Mode)  Each bit of this field specifies the bus width for e */
#define NUM_INT_PIN_MASK                                (0x3 << 4) /* Number of Interrupt Input Pins  This field indicates support of interrupt input  */
#define NUM_INT_PIN_POS                                 (4) /* Number of Interrupt Input Pins  This field indicates support of interrupt input  */
#define NUM_CLK_PIN_MASK                                (0x7 << 0) /* Number of Clock Pins (SD Mode)  This field indicates support of clock pins to se */
#define NUM_CLK_PIN_POS                                 (0) /* Number of Clock Pins (SD Mode)  This field indicates support of clock pins to se */

/* EMMC_EMMC_CTRL_R Register */

#define EMMC_RST_N_OE                                   (1U << 3) /* Output Enable control for EMMC Device Reset signal PAD control. This field drive */
#define EMMC_RST_N                                      (1U << 2) /* EMMC Device Reset signal control. This register field controls the sd_rst_n outp */
#define DISABLE_DATA_CRC_CHK                            (1U << 1) /* Disable Data CRC Check This bit controls masking of CRC16 error for Card Write i */
#define CARD_IS_EMMC                                    (1U << 0) /* eMMC Card present This bit indicates the type of card connected. An application  */

/* EMMC_ERROR_INT_SIGNAL_EN_R Register */

#define VENDOR_ERR_SIGNAL_EN3                           (1U << 15) /* The 16th bit of Error Interrupt Signal Enable is reserved. Values:  0x0 (FALSE): */
#define VENDOR_ERR_SIGNAL_EN2                           (1U << 14) /* The 15th bit of Error Interrupt Signal Enable is reserved. Values:  0x0 (FALSE): */
#define VENDOR_ERR_SIGNAL_EN1                           (1U << 13) /* The 14th bit of Error Interrupt Signal Enable is reserved. Values:  0x0 (FALSE): */
#define BOOT_ACK_ERR_SIGNAL_EN                          (1U << 12) /* Boot Acknowledgment Error (eMMC Mode only). Setting this bit to 1 enables genera */
#define RESP_ERR_SIGNAL_EN                              (1U << 11) /* Response Error Signal Enable (SD Mode only) Values:  0x0 (FALSE): Masked 0x1 (TR */
#define TUNING_ERR_SIGNAL_EN                            (1U << 10) /* Tuning Error Signal Enable (UHS-I Mode only) Values:  0x0 (FALSE): Masked 0x1 (T */
#define ADMA_ERR_SIGNAL_EN                              (1U << 9) /* ADMA Error Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define AUTO_CMD_ERR_SIGNAL_EN                          (1U << 8) /* Auto CMD Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked 0x */
#define CUR_LMT_ERR_SIGNAL_EN                           (1U << 7) /* Current Limit Error Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabl */
#define DATA_END_BIT_ERR_SIGNAL_EN                      (1U << 6) /* Data End Bit Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Maske */
#define DATA_CRC_ERR_SIGNAL_EN                          (1U << 5) /* Data CRC Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked 0x */
#define DATA_TOUT_ERR_SIGNAL_EN                         (1U << 4) /* Data Timeout Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Maske */
#define CMD_IDX_ERR_SIGNAL_EN                           (1U << 3) /* Command Index Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Mask */
#define CMD_END_BIT_ERR_SIGNAL_EN                       (1U << 2) /* Command End Bit Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Ma */
#define CMD_CRC_ERR_SIGNAL_EN                           (1U << 1) /* Command CRC Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked */
#define CMD_TOUT_ERR_SIGNAL_EN                          (1U << 0) /* Command Timeout Error Signal Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Ma */

/* EMMC_ERROR_INT_STAT_EN_R Register */

#define VENDOR_ERR_STAT_EN3                             (1U << 15) /* The 15th bit of Error Interrupt Status Enable register is reserved. Values:  0x0 */
#define VENDOR_ERR_STAT_EN2                             (1U << 14) /* The 14th bit of Error Interrupt Status Enable register is reserved. Values:  0x0 */
#define VENDOR_ERR_STAT_EN1                             (1U << 13) /* The 13th bit of Error Interrupt Status Enable register is reserved. Values:  0x0 */
#define BOOT_ACK_ERR_STAT_EN                            (1U << 12) /* Boot Acknowledgment Error (eMMC Mode only) Setting this bit to 1 enables setting */
#define RESP_ERR_STAT_EN                                (1U << 11) /* Response Error Status Enable (SD Mode only) Values:  0x0 (FALSE): Masked 0x1 (TR */
#define TUNING_ERR_STAT_EN                              (1U << 10) /* Tuning Error Status Enable (UHS-I Mode only) Values:  0x0 (FALSE): Masked 0x1 (T */
#define ADMA_ERR_STAT_EN                                (1U << 9) /* ADMA Error Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define AUTO_CMD_ERR_STAT_EN                            (1U << 8) /* Auto CMD Error Status Enable (SD/eMMC Mode only). Values:  0x0 (FALSE): Masked 0 */
#define CUR_LMT_ERR_STAT_EN                             (1U << 7) /* Current Limit Error Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabl */
#define DATA_END_BIT_ERR_STAT_EN                        (1U << 6) /* Data End Bit Error Status Enable (SD/eMMC Mode only). Values:  0x0 (FALSE): Mask */
#define DATA_CRC_ERR_STAT_EN                            (1U << 5) /* Data CRC Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked 0x */
#define DATA_TOUT_ERR_STAT_EN                           (1U << 4) /* Data Timeout Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Maske */
#define CMD_IDX_ERR_STAT_EN                             (1U << 3) /* Command Index Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Mask */
#define CMD_END_BIT_ERR_STAT_EN                         (1U << 2) /* Command End Bit Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Ma */
#define CMD_CRC_ERR_STAT_EN                             (1U << 1) /* Command CRC Error Status Enable (SD/eMMC Mode only) Values:  0x0 (FALSE): Masked */
#define CMD_TOUT_ERR_STAT_EN                            (1U << 0) /* Command Timeout Error Status Enable (SD/eMMC Mode only). Values:  0x0 (FALSE): M */

/* EMMC_ERROR_INT_STAT_R Register */

#define BOOT_ACK_ERR                                    (1U << 12) /* Boot Acknowledgement Error. This bit is set when there is a timeout for boot ack */
#define RESP_ERR                                        (1U << 11) /* Response Error. Host Controller Version 4.00 supports response error check funct */
#define TUNING_ERR                                      (1U << 10) /* Tuning Error. This bit is set when an unrecoverable error is detected in a tunin */
#define ADMA_ERR                                        (1U << 9) /* ADMA Error. This bit is set when the Host Controller detects error during ADMA-b */
#define AUTO_CMD_ERR                                    (1U << 8) /* Auto CMD Error. This error status is used by Auto CMD12 and Auto CMD23 in SD/eMM */
#define CUR_LMT_ERR                                     (1U << 7) /* Current Limit Error. By setting the SD Bus Power bit in the Power Control regist */
#define DATA_END_BIT_ERR                                (1U << 6) /* Data End Bit Error. This error occurs in SD/eMMC mode either when detecting 0 at */
#define DATA_CRC_ERR                                    (1U << 5) /* Data CRC Error. This error occurs in SD/eMMC mode when detecting CRC error when  */
#define DATA_TOUT_ERR                                   (1U << 4) /* Data Timeout Error. This bit is set in SD/eMMC mode when detecting one of the fo */
#define CMD_IDX_ERR                                     (1U << 3) /* Command Index Error. This bit is set if a Command Index error occurs in the comm */
#define CMD_END_BIT_ERR                                 (1U << 2) /* Command End Bit Error. This bit is set when detecting that the end bit of a comm */
#define CMD_CRC_ERR                                     (1U << 1) /* Command CRC Error. Command CRC Error is generated in SD/eMMC mode for following  */
#define CMD_TOUT_ERR                                    (1U << 0) /* Command Timeout Error. In SD/eMMC Mode,this bit is set only if no response is re */

