AlmAck/svdtonuttx/demo/h/da1470_emmc.h
/* EMMC_FORCE_AUTO_CMD_STAT_R Register */

#define FORCE_CMD_NOT_ISSUED_AUTO_CMD12                 (1U << 7) /* Force Event for Command Not Issued By Auto CMD12 Error Values: 0x1 (TRUE): Comma */
#define FORCE_AUTO_CMD_RESP_ERR                         (1U << 5) /* Force Event for Auto CMD Response Error Values: 0x1 (TRUE): Auto CMD Response Er */
#define FORCE_AUTO_CMD_IDX_ERR                          (1U << 4) /* Force Event for Auto CMD Index Error Values: 0x1 (TRUE): Auto CMD Index Error St */
#define FORCE_AUTO_CMD_EBIT_ERR                         (1U << 3) /* Force Event for Auto CMD End Bit Error Values: 0x1 (TRUE): Auto CMD End Bit Erro */
#define FORCE_AUTO_CMD_CRC_ERR                          (1U << 2) /* Force Event for Auto CMD CRC Error Values: 0x1 (TRUE): Auto CMD CRC Error Status */
#define FORCE_AUTO_CMD_TOUT_ERR                         (1U << 1) /* Force Event for Auto CMD Timeout Error Values: 0x1 (TRUE): Auto CMD Timeout Erro */
#define FORCE_AUTO_CMD12_NOT_EXEC                       (1U << 0) /* Force Event for Auto CMD12 Not Executed Values: 0x1 (TRUE): Auto CMD12 Not Execu */

/* EMMC_FORCE_ERROR_INT_STAT_R Register */

#define FORCE_VENDOR_ERR3                               (1U << 15) /* This bit (FORCE_VENDOR_ERR3) of the FORCE_ERROR_INT_STAT_R register is reserved. */
#define FORCE_VENDOR_ERR2                               (1U << 14) /* This bit (FORCE_VENDOR_ERR2) of the FORCE_ERROR_INT_STAT_R register is reserved. */
#define FORCE_VENDOR_ERR1                               (1U << 13) /* This bit (FORCE_VENDOR_ERR1) of the FORCE_ERROR_INT_STAT_R register is reserved. */
#define FORCE_BOOT_ACK_ERR                              (1U << 12) /* Force Event for Boot Ack error Values:  0x0 (FALSE): Not Affected 0x1 (TRUE): Bo */
#define FORCE_RESP_ERR                                  (1U << 11) /* Force Event for Response Error (SD Mode only) Values: 0x0 (FALSE): Not Affected  */
#define FORCE_TUNING_ERR                                (1U << 10) /* Force Event for Tuning Error (UHS-I Mode only) */
#define FORCE_ADMA_ERR                                  (1U << 9) /* Force Event for ADMA Error Values: 0x0 (FALSE): Not Affected 0x1 (TRUE): ADMA Er */
#define FORCE_AUTO_CMD_ERR                              (1U << 8) /* Force Event for Auto CMD Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not Affe */
#define FORCE_CUR_LMT_ERR                               (1U << 7) /* Force Event for Current Limit Error Values: 0x0 (FALSE): Not Affected 0x1 (TRUE) */
#define FORCE_DATA_END_BIT_ERR                          (1U << 6) /* Force Event for Data End Bit Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not  */
#define FORCE_DATA_CRC_ERR                              (1U << 5) /* Force Event for Data CRC Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not Affe */
#define FORCE_DATA_TOUT_ERR                             (1U << 4) /* Force Event for Data Timeout Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not  */
#define FORCE_CMD_IDX_ERR                               (1U << 3) /* Force Event for Command Index Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not */
#define FORCE_CMD_END_BIT_ERR                           (1U << 2) /* Force Event for Command End Bit Error (SD/eMMC Mode only) Values: 0x0 (FALSE): N */
#define FORCE_CMD_CRC_ERR                               (1U << 1) /* Force Event for Command CRC Error (SD/eMMC Mode only) Values: 0x0 (FALSE): Not A */
#define FORCE_CMD_TOUT_ERR                              (1U << 0) /* Force Event for Command Timeout Error (SD/eMMC Mode only) Values: 0x0 (FALSE): N */

/* EMMC_HOST_CNTRL_VERS_R Register */

#define VENDOR_VERSION_NUM_MASK                         (0xFF << 8) /* Vendor Version Number               This field is reserved for the vendor versio */
#define VENDOR_VERSION_NUM_POS                          (8) /* Vendor Version Number               This field is reserved for the vendor versio */
#define SPEC_VERSION_NUM_MASK                           (0xFF << 0) /* Specification Version Number These bits indicate the Host controller specificati */
#define SPEC_VERSION_NUM_POS                            (0) /* Specification Version Number These bits indicate the Host controller specificati */

/* EMMC_HOST_CTRL1_R Register */

#define CARD_DETECT_SIG_SEL                             (1U << 7) /* Card Detect Signal Selection. This bit selects a source for card detection. When */
#define CARD_DETECT_TEST_LVL                            (1U << 6) /* Card Detect Test Level. This bit is enabled while the Card Detect Signal Selecti */
#define EXT_DAT_XFER                                    (1U << 5) /* Extended Data Transfer Width. This bit controls 8-bit bus width mode of embedded */
#define DMA_SEL_MASK                                    (0x3 << 3) /* DMA Select. This field is used to select the DMA type. When Host Version 4 Enabl */
#define DMA_SEL_POS                                     (3) /* DMA Select. This field is used to select the DMA type. When Host Version 4 Enabl */
#define HIGH_SPEED_EN                                   (1U << 2) /* High Speed Enable (SD/eMMC Mode only). In SD/eMMC mode, this bit is used to dete */
#define DAT_XFER_WIDTH                                  (1U << 1) /* Data Transfer Width. For SD/eMMC mode,this bit selects the data transfer width o */
#define LED_CTRL                                        (1U << 0) /* LED Control. This bit is used to caution the user not to remove the card while t */

/* EMMC_HOST_CTRL2_R Register */

#define PRESET_VAL_ENABLE                               (1U << 15) /* Preset Value Enable This bit enables automatic selection of SDCLK frequency and  */
#define ASYNC_INT_ENABLE                                (1U << 14) /* Asynchronous Interrupt Enable This bit can be set if a card supports asynchronou */
#define ADDRESSING                                      (1U << 13) /* 64-bit Addressing This bit is effective when Host Version 4 Enable is set to 1.  */
#define HOST_VER4_ENABLE                                (1U << 12) /* Host Version 4 Enable This bit selects either Version 3.00 compatible mode or Ve */
#define CMD23_ENABLE                                    (1U << 11) /* CMD23 Enable If the card supports CMD23, this bit is set to 1. This bit is used  */
#define ADMA2_LEN_MODE                                  (1U << 10) /* ADMA2 Length Mode This bit selects ADMA2 Length mode to be either 16-bit or 26-b */
#define UHS2_IF_ENABLE                                  (1U << 8) /* UHS-II Interface Enable This bit is used to enable the UHS-II Interface. The val */
#define SAMPLE_CLK_SEL                                  (1U << 7) /* Sampling Clock Select This bit is used by the Host Controller to select the samp */
#define EXEC_TUNING                                     (1U << 6) /* Execute Tuning This bit is set to 1 to start the tuning procedure in UHS-I/eMMC  */
#define DRV_STRENGTH_SEL_MASK                           (0x3 << 4) /* Driver Strength Select This bit is used to select the Host Controller output dri */
#define DRV_STRENGTH_SEL_POS                            (4) /* Driver Strength Select This bit is used to select the Host Controller output dri */
#define SIGNALING_EN                                    (1U << 3) /* 1.8V Signaling Enable This bit controls voltage regulator for I/O cell in UHS-I/ */
#define UHS_MODE_SEL_MASK                               (0x7 << 0) /* UHS Mode/eMMC Speed Mode Select These bits are used to select UHS mode in the SD */
#define UHS_MODE_SEL_POS                                (0) /* UHS Mode/eMMC Speed Mode Select These bits are used to select UHS mode in the SD */

/* EMMC_MBIU_CTRL_R Register */

