AlmAck/svdtonuttx/demo/h/da1470_emmc.h
#define BURST_INCR16_EN                                 (1U << 3) /* INCR16 Burst Controls generation of INCR16 transfers on Master interface. Values */
#define BURST_INCR8_EN                                  (1U << 2) /* INCR8 Burst Controls generation of INCR8 transfers on Master interface. Values:  */
#define BURST_INCR4_EN                                  (1U << 1) /* INCR4 Burst Controls generation of INCR4 transfers on Master interface. Values:  */
#define UNDEFL_INCR_EN                                  (1U << 0) /* Undefined INCR Burst Controls generation of undefined length INCR transfer on Ma */

/* EMMC_MSHC_CTRL_R Register */

#define SW_CG_DIS                                       (1U << 4) /* Internal clock gating disable control This bit must be used to disable IP's inte */
#define CMD_CONFLICT_CHECK                              (1U << 0) /* Command conflict check This bit enables command conflict check. Note: DWC_mshc c */

/* EMMC_MSHC_VER_ID_R Register */

#define MSHC_VER_ID_MASK                                (0xFFFFFFFF << 0) /* Current release number This field indicates the Synopsys DesignWare Cores DWC_ms */
#define MSHC_VER_ID_POS                                 (0) /* Current release number This field indicates the Synopsys DesignWare Cores DWC_ms */

/* EMMC_MSHC_VER_TYPE_R Register */

#define MSHC_VER_TYPE_MASK                              (0xFFFFFFFF << 0) /* Current release type This field indicates the Synopsys DesignWare Cores DWC_mshc */
#define MSHC_VER_TYPE_POS                               (0) /* Current release type This field indicates the Synopsys DesignWare Cores DWC_mshc */

/* EMMC_NORMAL_INT_SIGNAL_EN_R Register */

#define CQE_EVENT_SIGNAL_EN                             (1U << 14) /* Command Queuing Engine Event Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRU */
#define FX_EVENT_SIGNAL_EN                              (1U << 13) /* FX Event Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define RE_TUNE_EVENT_SIGNAL_EN                         (1U << 12) /* Re-Tuning Event (UHS-I only) Signal Enable. Values:  0x0 (FALSE): Masked 0x1 (TR */
#define INT_C_SIGNAL_EN                                 (1U << 11) /* INT_C (Embedded) Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define INT_B_SIGNAL_EN                                 (1U << 10) /* INT_B (Embedded) Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define INT_A_SIGNAL_EN                                 (1U << 9) /* INT_A (Embedded) Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define CARD_INTERRUPT_SIGNAL_EN                        (1U << 8) /* Card Interrupt Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define CARD_REMOVAL_SIGNAL_EN                          (1U << 7) /* Card Removal Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define CARD_INSERTION_SIGNAL_EN                        (1U << 6) /* Card Insertion Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define BUF_RD_READY_SIGNAL_EN                          (1U << 5) /* Buffer Read Ready Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define BUF_WR_READY_SIGNAL_EN                          (1U << 4) /* Buffer Write Ready Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enable */
#define DMA_INTERRUPT_SIGNAL_EN                         (1U << 3) /* DMA Interrupt Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define BGAP_EVENT_SIGNAL_EN                            (1U << 2) /* Block Gap Event Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define XFER_COMPLETE_SIGNAL_EN                         (1U << 1) /* Transfer Complete Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define CMD_COMPLETE_SIGNAL_EN                          (1U << 0) /* Command Complete Signal Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */

/* EMMC_NORMAL_INT_STAT_EN_R Register */

#define CQE_EVENT_STAT_EN                               (1U << 14) /* CQE Event Status Enable  Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define FX_EVENT_STAT_EN                                (1U << 13) /* FX Event Status Enable This bit is added from Version 4.10.  Values:  0x0 (FALSE */
#define RE_TUNE_EVENT_STAT_EN                           (1U << 12) /* Re-Tuning Event (UHS-I only) Status Enable  Values:  0x0 (FALSE): Masked 0x1 (TR */
#define INT_C_STAT_EN                                   (1U << 11) /* INT_C (Embedded) Status Enable  If this bit is set to 0, the Host Controller cle */
#define INT_B_STAT_EN                                   (1U << 10) /* INT_B (Embedded) Status Enable  If this bit is set to 0, the Host Controller cle */
#define INT_A_STAT_EN                                   (1U << 9) /* INT_A (Embedded) Status Enable  If this bit is set to 0, the Host Controller cle */
#define CARD_INTERRUPT_STAT_EN                          (1U << 8) /* Card Interrupt Status Enable  If this bit is set to 0, the Host Controller clear */
#define CARD_REMOVAL_STAT_EN                            (1U << 7) /* Card Removal Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define CARD_INSERTION_STAT_EN                          (1U << 6) /* Card Insertion Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define BUF_RD_READY_STAT_EN                            (1U << 5) /* Buffer Read Ready Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define BUF_WR_READY_STAT_EN                            (1U << 4) /* Buffer Write Ready Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enable */
#define DMA_INTERRUPT_STAT_EN                           (1U << 3) /* DMA Interrupt Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define BGAP_EVENT_STAT_EN                              (1U << 2) /* Block Gap Event Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define XFER_COMPLETE_STAT_EN                           (1U << 1) /* Transfer Complete Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */
#define CMD_COMPLETE_STAT_EN                            (1U << 0) /* Command Complete Status Enable Values:  0x0 (FALSE): Masked 0x1 (TRUE): Enabled */

/* EMMC_NORMAL_INT_STAT_R Register */

#define ERR_INTERRUPT                                   (1U << 15) /* Error Interrupt. If any of the bits in the Error Interrupt Status register are s */
#define CQE_EVENT                                       (1U << 14) /* Command Queuing Event This status is set if Command Queuing/Crypto related event */
#define FX_EVENT                                        (1U << 13) /* FX Event. This status is set when R[14] of response register is set to 1 and Res */
#define RE_TUNE_EVENT                                   (1U << 12) /* Re-tuning Event. This bit is set if the Re-Tuning Request changes from 0 to 1. R */
#define INT_C                                           (1U << 11) /* INT_C (Embedded). This bit is set if INT_C is enabled and if INT_C# pin is in lo */
#define INT_B                                           (1U << 10) /* INT_B (Embedded). This bit is set if INT_B is enabled and if INT_B# pin is in lo */
#define INT_A                                           (1U << 9) /* INT_A (Embedded). This bit is set if INT_A is enabled and if INT_A# pin is in lo */
#define CARD_INTERRUPT                                  (1U << 8) /* Card Interrupt. This bit reflects the synchronized value of: - DAT[1] Interrupt  */
#define CARD_REMOVAL_STAT_R                             (1U << 7) /* Card Removal. This bit is set if the Card Inserted in the Present State register */
#define CARD_INSERTION                                  (1U << 6) /* Card Insertion This bit is set if the Card Inserted in the Present State registe */
#define BUF_RD_READY                                    (1U << 5) /* Buffer Read Ready. This bit is set if the Buffer Read Enable changes from 0 to 1 */
#define BUF_WR_READY                                    (1U << 4) /* Buffer Write Ready. This bit is set if the Buffer Write Enable changes from 0 to */
#define DMA_INTERRUPT                                   (1U << 3) /* DMA Interrupt. This bit is set if the Host Controller detects the SDMA Buffer Bo */
#define BGAP_EVENT                                      (1U << 2) /* Block Gap Event. This bit is set when both read/write transaction is stopped at  */
#define XFER_COMPLETE                                   (1U << 1) /* Transfer Complete. This bit is set when a read/write transfer and a command with */
#define CMD_COMPLETE                                    (1U << 0) /* Command Complete. In an SD/eMMC Mode, this bit is set when the end bit of a resp */

