AlmAck/svdtonuttx/demo/h/da1470_emmc.h
/* EMMC_PRESET_DDR50_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */

/* EMMC_PRESET_DS_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_HS_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_INIT_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate that the Driver strength is sup */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate that the Driver strength is sup */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when the Host Controller supp */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_SDR104_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value These bits specify a 10-bit preset value that  */

/* EMMC_PRESET_SDR12_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_SDR25_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_SDR50_R Register */

#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate Driver strength value supported */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when Host Controller supports */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value 10-bit preset value to be set in SDCLK/RCLK Fr */

/* EMMC_PRESET_UHS2_R Register */

