AlmAck/svdtonuttx/demo/h/da1470_emmc.h
#define DRV_SEL_VAL_MASK                                (0x3 << 14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define DRV_SEL_VAL_POS                                 (14) /* Driver Strength Select Value These bits indicate the Driver strength value suppo */
#define CLK_GEN_SEL_VAL                                 (1U << 10) /* Clock Generator Select Value This bit is effective when the Host Controller supp */
#define FREQ_SEL_VAL_MASK                               (0x3FF << 0) /* SDCLK/RCLK Frequency Select Value These bits specify the 10-bit preset value tha */
#define FREQ_SEL_VAL_POS                                (0) /* SDCLK/RCLK Frequency Select Value These bits specify the 10-bit preset value tha */

/* EMMC_PSTATE Register */

#define UHS2_IF_DETECT                                  (1U << 31) /* UHS-II Interface Detection. For SD/eMMC mode, this bit always returns 0.  Values */
#define LANE_SYNC                                       (1U << 30) /* Lane Synchronization. For SD/eMMC mode, this bit always returns 0.  Values: 0x0  */
#define IN_DORMANT_ST                                   (1U << 29) /* In Dormant Status For SD/eMMC mode, this bit always returns 0.  Values: 0x0 (FAL */
#define SUB_CMD_STAT                                    (1U << 28) /* Sub Command Status. This bit is used to distinguish between a main command and a */
#define CMD_ISSUE_ERR                                   (1U << 27) /* Command Not Issued by Error. This bit is set if a command cannot be issued after */
#define HOST_REG_VOL                                    (1U << 25) /* Host Regulator Voltage Stable. This bit is used to check whether the host regula */
#define CMD_LINE_LVL                                    (1U << 24) /* Command-Line Signal Level. This bit is used to check the CMD line level to recov */
#define DAT_3_0_MASK                                    (0xF << 20) /* DAT[3:0] Line Signal Level. This bit is used to check the DAT line level to reco */
#define DAT_3_0_POS                                     (20) /* DAT[3:0] Line Signal Level. This bit is used to check the DAT line level to reco */
#define WR_PROTECT_SW_LVL                               (1U << 19) /* Write Protect Switch Pin Level. This bit is supported only for memory and combo  */
#define CARD_DETECT_PIN_LEVEL                           (1U << 18) /* Card Detect Pin Level. This bit reflects the inverse synchronized value of the c */
#define CARD_STABLE                                     (1U << 17) /* Card Stable. This bit indicates the stability of the Card Detect Pin Level. A ca */
#define CARD_INSERTED                                   (1U << 16) /* Card Inserted. This bit indicates whether a card has been inserted. The Host Con */
#define BUF_RD_ENABLE                                   (1U << 11) /* Buffer Read Enable. This bit is used for non-DMA transfers. This bit is set if v */
#define BUF_WR_ENABLE                                   (1U << 10) /* Buffer Write Enable. This bit is used for non-DMA transfers. This bit is set if  */
#define RD_XFER_ACTIVE                                  (1U << 9) /* Read Transfer Active. This bit indicates whether a read transfer is active for S */
#define WR_XFER_ACTIVE                                  (1U << 8) /* Write Transfer Active. This status indicates whether a write transfer is active  */
#define DAT_7_4_MASK                                    (0xF << 4) /* DAT[7:4] Line Signal Level. This bit is used to check the DAT line level to reco */
#define DAT_7_4_POS                                     (4) /* DAT[7:4] Line Signal Level. This bit is used to check the DAT line level to reco */
#define RE_TUNE_REQ                                     (1U << 3) /* Re-Tuning Request. DWC_mshc does not generate retuning request. The software mus */
#define DAT_LINE_ACTIVE                                 (1U << 2) /* DAT Line Active (SD/eMMC Mode only). This bit indicates whether one of the DAT l */
#define CMD_INHIBIT_DAT                                 (1U << 1) /* Command Inhibit (DAT). This bit is applicable for SD/eMMC mode and is generated  */
#define CMD_INHIBIT                                     (1U << 0) /* Command Inhibit (CMD). This bit indicates the following : - SD/eMMC mode: If thi */

/* EMMC_PWR_CTRL_R Register */

#define SD_BUS_VOL_VDD2_MASK                            (0x7 << 5) /* SD Bus Voltage Select for VDD2. This is irrelevant for SD/eMMC card.  Values: 0x */
#define SD_BUS_VOL_VDD2_POS                             (5) /* SD Bus Voltage Select for VDD2. This is irrelevant for SD/eMMC card.  Values: 0x */
#define SD_BUS_PWR_VDD2                                 (1U << 4) /* SD Bus Power for VDD2. This is irrelevant for SD/eMMC card.  Values: 0x0 (OFF):  */
#define SD_BUS_VOL_VDD1_MASK                            (0x7 << 1) /* SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD. These bits enabl */
#define SD_BUS_VOL_VDD1_POS                             (1) /* SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD. These bits enabl */
#define SD_BUS_PWR_VDD1                                 (1U << 0) /* SD Bus Power for VDD1. This bit enables VDD1 power of the card. This setting is  */

/* EMMC_P_EMBEDDED_CNTRL Register */

#define REG_OFFSET_EMBEDDED_CNTRL_ADDR_MASK             (0xFFF << 0) /* Offset Address of Embedded Control register. */
#define REG_OFFSET_EMBEDDED_CNTRL_ADDR_POS              (0) /* Offset Address of Embedded Control register. */

/* EMMC_P_VENDOR_SPECIFIC_AREA Register */

#define REG_OFFSET_ADDR_VENDOR_MASK                     (0xFFF << 0) /* Base offset Address for Vendor-Specific registers. */
#define REG_OFFSET_ADDR_VENDOR_POS                      (0) /* Base offset Address for Vendor-Specific registers. */

/* EMMC_P_VNDR2_SPECIFIC_AREA Register */

#define REG_OFFSET_ADDR_VNDR2_MASK                      (0xFFFF << 0) /* Base offset Address for Command Queuing registers. */
#define REG_OFFSET_ADDR_VNDR2_POS                       (0) /* Base offset Address for Command Queuing registers. */

